---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures
source: html/80edce50-dc6e-a7d0-71ea-f5a010637cf8.htm
---
# BuiltInFailures.MechanicalFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.